Revit 2026 API

# FaceArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FaceArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
FaceArrayIterator()
```
```fsharp
new : unit -> FaceArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

FaceArrayIterator Class

Autodesk.Revit.DB Namespace